N=int(input())

# 초기화 배열 행/렬 헷갈리지 말고 [0,0,0,0...]로 잘 표현 됐는지 확인-dibugging 함
arr=[[0 for _ in range(10)] for _ in range(N+1)]

#########################################################
#########################################################
#처음에 초기화 해주는 거 잊지말기!!!!!!!! (****)    ##########
arr[1]=[0]+[1 for _ in range(1,10)]            ##########
#########################################################
#########################################################

# print(arr)

# i 범위 주의!!!! 초기화 해준거 다음으로 범위 시작!!!
# for i in range(1,N+1): => 1 틀림, 2로 수정!!
for i in range(2, N + 1):
    for j in range(10):
        if j==0:
            arr[i][j]=arr[i-1][j+1]

        elif j==9:
            arr[i][j] = arr[i - 1][j - 1]

        else:
            # print(i,j)
            # print(i - 1, j - 1, j + 1)
            arr[i][j]=arr[i-1][j-1]+arr[i-1][j+1]
            # print(i-1,j-1,j+1)

sum=0
for _ in arr[N]:
    sum+=_
print(sum)



#풀이 2
#그 다음꺼 더하는데 지금 요소 사용
